In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv(r'C:\Users\aashutosh\Downloads\Salary_Data.csv')

In [6]:
df

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872

In [7]:
df.mean()

YearsExperience        5.313333
Salary             76003.000000
dtype: float64

In [8]:
df['Salary'].mean()

np.float64(76003.0)

In [9]:
df.median()

YearsExperience        4.7
Salary             65237.0
dtype: float64

In [10]:
df['Salary'].median()

65237.0

In [11]:
df.mode()

    YearsExperience  Salary
0               3.2   37731
1               4.0   39343
2               NaN   39891
3               NaN   43525
4               NaN   46205
5               NaN   54445
6               NaN   55794
7               NaN   56642
8               NaN   56957
9               NaN   57081
10              NaN   57189
11              NaN   60150
12              NaN   61111
13              NaN   63218
14              NaN   64445
15              NaN   66029
16              NaN   67938
17              NaN   81363
18              NaN   83088
19              NaN   91738
20              NaN   93940
21              NaN   98273
22              NaN  101302
23              NaN  105582
24              NaN  109431
25              NaN  112635
26              NaN  113812
27              NaN  116969
28              NaN  121872
29              NaN  122391

In [12]:
df['Salary'].mode()

0      37731
1      39343
2      39891
3      43525
4      46205
5      54445
6      55794
7      56642
8      56957
9      57081
10     57189
11     60150
12     61111
13     63218
14     64445
15     66029
16     67938
17     81363
18     83088
19     91738
20     93940
21     98273
22    101302
23    105582
24    109431
25    112635
26    113812
27    116969
28    121872
29    122391
Name: Salary, dtype: int64

In [13]:
df.var()

YearsExperience    8.053609e+00
Salary             7.515510e+08
dtype: float64

In [14]:
df['Salary'].var()

751550960.4137931

In [15]:
df.std()

YearsExperience        2.837888
Salary             27414.429785
dtype: float64

In [16]:
df['Salary'].std()

27414.4297845823

In [17]:
from scipy.stats import variation

variation(df.values)

array([0.5251297 , 0.35463929])

In [18]:
variation(df['Salary'])

np.float64(0.3546392938275572)

In [19]:
df.corr()

                 YearsExperience    Salary
YearsExperience         1.000000  0.978242
Salary                  0.978242  1.000000

In [21]:
df['Salary'].corr(df['YearsExperience'])

np.float64(0.9782416184887598)

In [22]:
df.skew()

YearsExperience    0.37956
Salary             0.35412
dtype: float64

In [23]:
df['Salary'].skew()

np.float64(0.35411967922959153)

In [24]:
df.sem()

YearsExperience       0.518125
Salary             5005.167198
dtype: float64

In [25]:
df['Salary'].sem()

np.float64(5005.167198052405)

In [26]:
import scipy.stats as stats
df.apply(stats.zscore)

    YearsExperience    Salary
0         -1.510053 -1.360113
1         -1.438373 -1.105527
2         -1.366693 -1.419919
3         -1.187494 -1.204957
4         -1.115814 -1.339781
5         -0.864935 -0.718307
6         -0.829096 -0.588158
7         -0.757416 -0.799817
8         -0.757416 -0.428810
9         -0.578216 -0.698013
10        -0.506537 -0.474333
11        -0.470697 -0.749769
12        -0.470697 -0.706620
13        -0.434857 -0.702020
14        -0.291498 -0.552504
15        -0.148138 -0.299217
16        -0.076458 -0.370043
17        -0.004779  0.262859
18         0.210261  0.198860
19         0.246100  0.665476
20         0.532819  0.583780
21         0.640339  0.826233
22         0.927058  0.938611
23         1.034577  1.402741
24         1.213777  1.240203
25         1.321296  1.097402
26         1.500496  1.519868
27         1.536336  1.359074
28         1.787215  1.721028
29         1.858894  1.701773

In [27]:
stats.zscore(df['Salary'])

array([-1.36011263, -1.10552744, -1.419919  , -1.20495739, -1.33978143,
       -0.71830716, -0.58815781, -0.79981746, -0.42881019, -0.69801306,
       -0.47433279, -0.74976858, -0.70662043, -0.70201994, -0.55250402,
       -0.29921736, -0.37004264,  0.26285865,  0.19885989,  0.66547573,
        0.58377993,  0.82623317,  0.93861127,  1.40274136,  1.24020308,
        1.09740238,  1.51986835,  1.3590738 ,  1.72102849,  1.70177321])

In [28]:
a = df.shape[0]
b = df.shape[1]

degree_of_freedom = a-b
print(degree_of_freedom)

28

In [30]:
x = df.iloc[:,:-1].values
y = df.iloc[:,1].values

y_mean = np.mean(y)

from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.20,random_state=0)

from sklearn.linear_model import LinearRegression
reg = LinearRegression()
reg.fit(x_train,y_train)
y_pred = reg.predict(x_test)

ssr = np.sum((y_pred-y_mean)**2)
print(ssr)

6263152884.28413

In [33]:
x = df.iloc[:,:-1].values
y = df.iloc[:,1].values


from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.20,random_state=0)


from sklearn.linear_model import LinearRegression
reg = LinearRegression()
reg.fit(x_train,y_train)
y_pred = reg.predict(x_test)

y = y[0:6]
sse = np.sum((y - y_pred)**2)
print(sse)

15274062883.943203

In [35]:
mean_total = np.mean(df.values)
sst = np.sum((df.values-mean_total)**2)
print(sst)

108429703765.82735

In [36]:
r_square = ssr/sst
r_square

np.float64(0.05776233510524468)